Repository: moayad-star/blink-comparison
Catalog: lib/l10n/app_*.arb
Languages: ar

# appDescription
source: Simplifies comparing photos of tamper-evident seals and patterns using your eyes. More information and also to help the project: https://github.com/proninyaroslav/blink-comparison
ar: يبسط مقارنة الصور للأختام والنقوش التي تظهر عليها علامات التلاعب باستخدام عينيك. مزيد من المعلومات وأيضًا للمساعدة في المشروع: https://github.com/proninyaroslav/blink-comparison

# appLicense
source: Blink Comparison is Free And Open Source software (FOSS), released under the terms of the GNU General Public License v3 (GPLv3) https://www.gnu.org/licenses/gpl-3.0.html
ar: برنامج Blink Comparison هو برنامج مجاني ومفتوح المصدر (FOSS)، تم إصداره بموجب شروط رخصة جنو العامة v3 (GPLv3) https://www.gnu.org/licenses/gpl-3.0.html

source: Yes
ar: نعم

source: No
ar: لا

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Close
ar: إغلاق

source: Error
ar: خطأ

source: Add
ar: إضافة

source: Show
ar: عرض

source: Delete
ar: حذف

source: Accept
ar: قبول

source: Retry
ar: إعادة المحاولة

source: Page Not Found
ar: الصفحة غير موجودة

# setPasswordDescription
source: Set a password. This is necessary to encrypt and store the reference images
ar: قم بتعيين كلمة مرور. هذا ضروري لتشفير وتخزين الصور المرجعية

# enterPassword
source: Password
ar: كلمة المرور

# enterPasswordAgain
source: Password again
ar: أعد إدخال كلمة المرور

source: Sign in
ar: تسجيل الدخول

# passwordTooShort
source: Password length must be at least {number} characters
ar: يجب أن تكون طول كلمة المرور على الأقل {number} حرفًا

# passwordTooLong
source: Password length must be no more than {number} characters
ar: يجب أن تكون طول كلمة المرور لا تزيد عن {number} حرفًا

source: Password mismatch
ar: عدم تطابق كلمة المرور

# savePasswordFailed
source: Unable to save password
ar: غير قادر على حفظ كلمة المرور

# passwordEmptyError
source: Password cannot be empty
ar: لا يمكن أن تكون كلمة المرور فارغة

# passwordRepeatError
source: Please repeat the password
ar: يرجى تكرار كلمة المرور

# crashDialogSummary
source: An app error occurred. You can report it to the developers
ar: حدث خطأ في التطبيق. يمكنك الإبلاغ عنه للمطورين

# crashDialogExtraInfo
source: Add extra info and comments here:
ar: أضف معلومات إضافية وتعليقات هنا:

# crashDialogReport
source: Report
ar: الإبلاغ

# crashDialogMoreDetails
source: More details
ar: مزيد من التفاصيل

# crashDialogNoEmailApp
source: No email app found. You can manually copy the error and send it to {email} or send on the project page {pageUrl}
ar: لم يتم العثور على تطبيق بريد إلكتروني. يمكنك نسخ الخطأ يدويًا وإرساله إلى {email} أو إرساله على صفحة المشروع {pageUrl}

# openLinkFailed
source: Unable to open link
ar: غير قادر على فتح الرابط

# signInDescription
source: Sign in to modify and view reference images
ar: تسجيل الدخول لتعديل وعرض الصور المرجعية

source: Wrong password
ar: كلمة مرور خاطئة

# emptyPasswordError
source: Password cannot be empty
ar: لا يمكن أن تكون كلمة المرور فارغة

# loadPasswordFailed
source: Unable to load password from storage
ar: غير قادر على تحميل كلمة المرور من التخزين

# addReferenceImageDescription
source: List is empty. Add an image to it
ar: القائمة فارغة. أضف صورة إليها

# takePhoto
source: Take a photo
ar: التقاط صورة

source: Select image
ar: اختر صورة

# savingImageMessage
source: Saving...
ar: جارٍ الحفظ...

# selectImagesFailed
source: Unable to select images
ar: غير قادر على اختيار الصور

# defaultNotifyChannelTitle
source: Default
ar: افتراضي

# defaultNotifyChannelDescription
source: All notifications that don't suitable for the other categories
ar: جميع الإشعارات التي لا تناسب الفئات الأخرى

# foregroundNotificationChannel
source: Foreground notification
ar: إشعار في المقدمة

# saveRefImageNotificationTitle
source: Saving a reference images in the background...
ar: جارٍ حفظ صورة مرجعية في الخلفية...

source: Refresh
ar: تحديث

# loadPageFailed
source: Failed to load page
ar: فشل في تحميل الصفحة

# saveImageError
source: An error occurred while saving
ar: حدث خطأ أثناء الحفظ

source: I/O error
ar: خطأ في الإدخال/الإخراج

source: Encryption error
ar: خطأ في التشفير

# selectedCounter
source: Selected: {count}
ar: المحدد: {count}

# deleteImagesDialog
source: {howMany, plural, one {Do you want to delete the selected image?} other {Do you want to delete the selected images?}}
ar: {howMany, plural, one {هل تريد حذف الصورة المحددة؟} other {هل تريد حذف الصور المحددة؟}}

# imagesDeleted
source: {howMany, plural, one {Image deleted} other {Images deleted}}
ar: {howMany, plural, one {تم حذف الصورة} other {تم حذف الصور}}

# deleteImagesFailed
source: {howMany, plural, one {Failed to delete image} other {Failed to delete some images}}
ar: {howMany, plural, one {فشل في حذف الصورة} other {فشل في حذف بعض الصور}}

source: Select all
ar: تحديد الكل

# loadingReferenceImage
source: Loading and decrypting, please wait...
ar: جارٍ التحميل/فك التشفير، يرجى الانتظار...

# openCameraError
source: Unable to open the camera
ar: غير قادر على فتح الكاميرا

# cameraErrorReason
source: Error: {reason}
ar: خطأ: {reason}

# noSelectedCameraError
source: Error: no camera selected or unavailable
ar: خطأ: لا توجد كاميرا محددة أو غير متاحة

# takePhotoError
source: Unable to take a photo
ar: غير قادر على التقاط صورة

source: Show error
ar: عرض الخطأ

# switchCameraFlashError
source: Failed to switch flash mode
ar: فشل في تغيير وضع الفلاش

# loadReferenceImageFailed
source: Failed to load reference image
ar: فشل في تحميل الصورة المرجعية

source: Reference image not found
ar: لم يتم العثور على الصورة المرجعية

# loadReferenceImageFailedIO
source: I/O error occurred while loading the reference image
ar: حدث خطأ في الإدخال/الإخراج أثناء تحميل الصورة المرجعية

# decryptReferenceImageNoEncryptKey
source: Failed to decrypt reference image: missing encrypt key
ar: فشل في فك تشفير الصورة المرجعية: مفتاح التشفير مفقود

# decryptReferenceImageFailed
source: Failed to decrypt reference image
ar: فشل في فك تشفير الصورة المرجعية

# decryptReferenceImageInvalidKey
source: Failed to decrypt reference image: invalid encrypt key
ar: فشل في فك تشفير الصورة المرجعية: مفتاح التشفير غير صالح

# imageOverlayOpacity
source: Overlay opacity
ar: شفافية التراكب

# saveImageInvalidKey
source: Failed to save the reference image: invalid encrypt key
ar: فشل في حفظ الصورة المرجعية: مفتاح التشفير غير صالح

source: Settings
ar: الإعدادات

# settingsAppearance
source: Appearance
ar: المظهر

# settingsTheme
source: Theme
ar: الثيم

# settingsThemeSystem
source: System
ar: نظام

# settingsThemeLight
source: Light
ar: فاتح

# settingsThemeDark
source: Dark
ar: داكن

# settingsLanguage
source: Language
ar: اللغة

# settingsSystemLanguageOption
source: System
ar: نظام

# settingsReferenceImageBorderColor
source: Reference image border color
ar: لون حدود الصورة المرجعية

# settingsBlinkComparisonPage
source: Comparison page
ar: صفحة المقارنة

# settingsCamera
source: Camera
ar: الكاميرا

# settingsFlashByDefault
source: Enable flash by default
ar: تفعيل الفلاش بشكل افتراضي

# imageOverlayOpacityCaseTooltip
source: You can change the reference image overlay opacity as you like in the settings menu above
ar: يمكنك تغيير شفافية تراكب الصورة المرجعية كما تريد في قائمة الإعدادات أعلاه

# referenceImageBorderCaseTooltip
source: The colored border around denotes the reference image. The border color can be changed in the app settings
ar: الحد الملون حول الصورة يدل على الصورة المرجعية. يمكن تغيير لون الحدود في إعدادات التطبيق

# blinkComparisonCaseTooltip
source: Pressing anywhere on the screen toggles between the reference image and the image you just took. Fast switching helps you see differences in images
ar: الضغط في أي مكان على الشاشة يبدل بين الصورة المرجعية والصورة التي التقطتها للتو. يساعد التبديل السريع في رؤية الفروق بين الصور

# aboutApp
source: About
ar: حول

source: Changelog
ar: سجل التغييرات

# settingsCameraFullscreenMode
source: Fullscreen mode
ar: وضع ملء الشاشة
